app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "The Beatles"], ["description", "Abbey Road"], ["created_at", "2018-11-06 17:45:18.264351"], ["updated_at", "2018-11-06 17:45:18.264351"]]
---
  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]
---
  def destroy
    @id = @artist.id
    @artist.destroy

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
    def load_artist
      @artist = Artist.find(params[:id])